
 Функция СведенияОВнешнейОбработке() Экспорт
     РегистрационныеДанные = Новый Структура;
     РегистрационныеДанные.Вставить("Наименование", "Продажи и Остатки за 30 дненй (исправленная)");//В списке доп обработок
     РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
     РегистрационныеДанные.Вставить("Версия", "9");
     
     //ДополнительнаяОбработка
     //ДополнительныйОтчет
     //ЗаполнениеОбъекта
     //Отчет
     //ПечатнаяФорма
     //СозданиеСвязанныхОбъектов
     РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
     
     РегистрационныеДанные.Вставить("Информация", "Добавлен учет парамещений с S100, документов Списание Товаров");
     
     ///////////// команды /////////////////////////
     тзКоманд = Новый ТаблицаЗначений;
     тзКоманд.Колонки.Добавить("Идентификатор");
     тзКоманд.Колонки.Добавить("Представление");
     тзКоманд.Колонки.Добавить("Модификатор");
     тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
     тзКоманд.Колонки.Добавить("Использование");
     
     строкаКоманды = тзКоманд.Добавить();
     строкаКоманды.Идентификатор = "1";
     строкаКоманды.Представление = "Продажи и Остатки за 30 дней (исправленная)";//В списке доп обработок
     строкаКоманды.ПоказыватьОповещение = Истина;
     строкаКоманды.Использование = "ОткрытиеФормы";
     
     РегистрационныеДанные.Вставить("Команды", тзКоманд);
     
     ////////////// назначение (в каких объектах используется) /////////////////////////
     //для печ.форм, заполнения, ввода свазанных объектов
     //МассивНазначений = Новый Массив;
     //МассивНазначений.Добавить("Документ.*"); // все документы назначаются
     //МассивНазначений.Добавить("Документ.АвансовыйОтчет");
     //МассивНазначений.Добавить("Документ.ЗаказПокупателя");
     //РегистрационныеДанные.Вставить("Назначение", МассивНазначений);
     
     Возврат РегистрационныеДанные;
     
 КонецФункции
